> @matthewmelvin , are you still having false diff issues?? I've tested with your tf file and not getting diffs anymore.

Unfortunately I am still seeing the same persistent diff with the latest version.

```
terraform@974f669cbe4b:~/templates/clu05$ terraform version 
Terraform v0.12.28
+ provider.local v1.4.0
+ provider.null v2.1.2
+ provider.proxmox (unversioned)
+ provider.rke v1.0.1
terraform@974f669cbe4b:~/templates/clu05$ terraform plan -no-color | grep -E '^([[:space:]]*[#~+]|-/)' 
  ~ update in-place
  # rke_cluster.cluster will be updated in-place
  ~ resource "rke_cluster" "cluster" {
      ~ cluster_cidr              = "10.42.0.0/16" -> (known after apply)
      ~ cluster_dns_server        = "10.43.0.10" -> (known after apply)
      ~ cluster_domain            = "cluster.local" -> (known after apply)
      ~ kube_config_yaml          = (sensitive value)
      ~ rke_cluster_yaml          = (sensitive value)
      ~ rke_state                 = (sensitive value)
terraform@974f669cbe4b:~/templates/clu05$
```
[issue-207-test-1594177150.txt](https://github.com/rancher/terraform-provider-rke/files/4888167/issue-207-test-1594177150.txt)
[issue-207-rke-resource-1594177150.txt](https://github.com/rancher/terraform-provider-rke/files/4888170/issue-207-rke-resource-1594177150.txt)
[issue-207-full-plan-1594177150.txt](https://github.com/rancher/terraform-provider-rke/files/4888171/issue-207-full-plan-1594177150.txt)


